# 1) Создайте переменную

my_heigh = 171
print(my_heigh)

# 2) Перезапишите переменную

my_name = 'Руслан'
my_name = 'Руслан Серебряков'
print(my_name)

# 3) Получите пользовательский ввод

pet_name = input('Как зовут вашего питомца? ')
print('Ваш любимчик — ' + pet_name)

# 4) Создание функции

def print_python():
    print('Учу Python!')

print_python()

# 5) Параметризация функций

def print_letter(let):
    print(let, end='')

print_letter('П')
print_letter('р')
print_letter('и')
print_letter('в')
print_letter('е')
print_letter('т')
print_letter(' ')
print_letter('А')
print_letter('в')
print_letter('т')
print_letter('о')
print_letter('м')
print_letter('а')
print_letter('т')
print_letter('и')
print_letter('з')
print_letter('а')
print_letter('ц')
print_letter('и')
print_letter('я!')